app/controllers/photos_controller.rb

  def index
    @photos = Photo.all
---
SELECT * FROM "photos"

  def show
    @photo = Photo.find(params[:id])
---
SELECT * FROM "photos" WHERE ("photos"."id" = 1)

  def edit
    @photo = Photo.find(params[:id])
---
SELECT * FROM "photos" WHERE ("photos"."id" = 6)

 def create
  @photo = Photo.new(params[:photo])
  if @photo.save
---
INSERT INTO "photos" ("image_height", "updated_at", "image_filename", "image_width", "created_at") VALUES(60, '2009-10-10 18:36:00', 'http://wiki.github.com/images/modules/header/logov3.png', NULL, '2009-10-10 18:36:00')

  def update
    @photo = Photo.find(params[:id])

    respond_to do |format|
      if @photo.update_attributes(params[:photo])
---
SELECT * FROM "photos" WHERE ("photos"."id" = 6)
UPDATE "photos" SET "image_filename" = '/public/images/user_uploads/chicken%20and%20waffle.jpg', "updated_at" = '2009-10-10 19:08:48' WHERE "id" = 6